eclipse-threadx/getting-started/Renesas/RX65N_Cloud_Kit/lib/rx_driver_package/src/smc_gen/r_sci_rx/src/r_sci_rx_dmaca.c
/**********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO
 * THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2020 Renesas Electronics Corporation. All rights reserved.
 *********************************************************************************************************************/
/**********************************************************************************************************************
* File Name    : r_sci_rx_dmaca.c
* Description  : 
***********************************************************************************************************************
* History : DD.MM.YYYY Version Description
*           25.08.2020 1.00    Initial Release
***********************************************************************************************************************/

/**********************************************************************************************************************
 Includes   <System Includes> , "Project Includes"
 *********************************************************************************************************************/
#include "platform.h"
#include "r_sci_rx_private.h"
#include "r_sci_rx_if.h"
#if ((TX_DTC_DMACA_ENABLE & 0x02) || (RX_DTC_DMACA_ENABLE & 0x02))
#include "r_dmaca_rx_if.h"
#include "r_sci_rx_dmaca.h"
#include "r_sci_rx_platform.h"

/**********************************************************************************************************************
 Macro definitions
 *********************************************************************************************************************/
#define SCI_PRV_RX_FIFO_THRESHOLD   (hdl->rom->regs->FCR.BIT.RTRG)

/**********************************************************************************************************************
 Typedef definitions
 *********************************************************************************************************************/

/**********************************************************************************************************************
 Exported global variables
 *********************************************************************************************************************/


/**********************************************************************************************************************
 Private (static) variables and functions
 *********************************************************************************************************************/
static void sci0_dmac_rx_callback(void);
static void sci1_dmac_rx_callback(void);
static void sci2_dmac_rx_callback(void);
static void sci3_dmac_rx_callback(void);
static void sci4_dmac_rx_callback(void);
static void sci5_dmac_rx_callback(void);
static void sci6_dmac_rx_callback(void);
static void sci7_dmac_rx_callback(void);
static void sci8_dmac_rx_callback(void);
static void sci9_dmac_rx_callback(void);
static void sci10_dmac_rx_callback(void);
static void sci11_dmac_rx_callback(void);
static void sci12_dmac_rx_callback(void);
static void sci_dmac_rx_handler(sci_hdl_t const hdl);

static void sci0_dmac_tx_callback(void);
static void sci1_dmac_tx_callback(void);
static void sci2_dmac_tx_callback(void);
static void sci3_dmac_tx_callback(void);
static void sci4_dmac_tx_callback(void);
static void sci5_dmac_tx_callback(void);
static void sci6_dmac_tx_callback(void);
static void sci7_dmac_tx_callback(void);
static void sci8_dmac_tx_callback(void);
static void sci9_dmac_tx_callback(void);
static void sci10_dmac_tx_callback(void);
static void sci11_dmac_tx_callback(void);
static void sci12_dmac_tx_callback(void);
static void sci_dmac_tx_handler(sci_hdl_t const hdl);

static uint8_t tx_dummy_buf = SCI_CFG_DUMMY_TX_BYTE;
static uint8_t rx_dummy_buf;

#if SCI_CFG_FIFO_INCLUDED
/**********************************************************************************************************************
* Function Name: sci_txfifo_dmaca_create
* Description  : This function create DMAC to transmit data from p_src to SCI TX FIFO (by DMAC without CPU)
* Arguments    : hdl -
*                    handle for channel (ptr to chan control block)
*                p_src -
*                    The address of source data need to be sent
*                lenght -
*                    The number of data need to be sent
* Return Value : SCI_SUCCESS -
*                    Create DMAC successfully
*                SCI_ERR_DMACA -
*                    Create DMAC NOT successfully
 *********************************************************************************************************************/
sci_err_t sci_txfifo_dmaca_create(sci_hdl_t const hdl, uint8_t *p_src, uint16_t const length)
{
    sci_err_t     err_sci = SCI_SUCCESS;
    dmaca_return_t err_dmaca = DMACA_SUCCESS;
    dmaca_stat_t   stat_dmaca;
    dmaca_transfer_data_cfg_t tx_cfg_dmaca;
    sci_fifo_ctrl_t          *p_tctrl_dma;
    p_tctrl_dma = &hdl->queue[hdl->qindex_app_tx];

    tx_cfg_dmaca.act_source           = hdl->rom->dmaca_tx_act_src;
    tx_cfg_dmaca.transfer_mode        = DMACA_TRANSFER_MODE_BLOCK;
    tx_cfg_dmaca.data_size            = DMACA_DATA_SIZE_BYTE;
    tx_cfg_dmaca.dtie_request         = DMACA_TRANSFER_END_INTERRUPT_ENABLE;
    tx_cfg_dmaca.interrupt_sel        = DMACA_CLEAR_INTERRUPT_FLAG_BEGINNING_TRANSFER;
    tx_cfg_dmaca.des_addr_mode        = DMACA_DES_ADDR_FIXED;
    tx_cfg_dmaca.p_des_addr           = (void *)&hdl->rom->regs->FTDR.BYTE.L;

